In [1]:
import pandas as pd

# Import Floods data
df_floods = pd.read_csv(r'C:\Users\jonnaa\OneDrive - Highways England\Desktop\Datasets\Test/poc_floods.csv')       # Dt

# Import Jobs data
df_jobs = pd.read_csv(r'C:\Users\jonnaa\OneDrive - Highways England\Desktop\Datasets\Test/poc_jobs.csv')       # Dt

In [19]:
df_floods

  Flood       date  date2week
0    A1 2022-04-21 2022-05-05
1    Q2 2022-05-22 2022-06-05
2    Q3 2022-04-23 2022-05-07
3    R4 2022-04-24 2022-05-08

In [18]:
from datetime import datetime

df_floods['date'] = pd.to_datetime(df_floods['date'])
df_jobs['date'] = pd.to_datetime(df_jobs['date'])

df_floods['date2week'] = df_floods['date'] + pd.DateOffset(days=14)

df_floods.dtypes

Flood                object
date         datetime64[ns]
date2week    datetime64[ns]
dtype: object

In [17]:
df_jobs

  Jobs       date
0   J1 2022-04-30
1   J2 2022-01-05
2   J3 2022-02-05
3   J4 2022-03-05

In [21]:
import pandasql as ps

sqlcode = '''
select *
from df_jobs
left join df_floods on 1=1
where df_jobs.date >= df_floods.date and df_jobs.date <= df_floods.date2week
'''

# left join df_jobs on df_jobs.cusip=B.ncusip
# group by A.cusip

newdf = ps.sqldf(sqlcode,locals())
newdf

,Jobs,date,Flood,date,date2week
0,J1,2022-04-30 00:00:00.000000,A1,2022-04-21 00:00:00.000000,2022-05-05 00:00:00.000000
1,J1,2022-04-30 00:00:00.000000,Q3,2022-04-23 00:00:00.000000,2022-05-07 00:00:00.000000
2,J1,2022-04-30 00:00:00.000000,R4,2022-04-24 00:00:00.000000,2022-05-08 00:00:00.000000